// 這是一個包含所有鹿港景點資料的 JavaScript 陣列 (Array)。
const lukangData = [
    // 古蹟
    {
        name: "鹿港民俗文物館",
        lat: 24.054063187383974,
        lng: 120.4361934248276,
        category: "古蹟",
        story: "這裡是日治時期開始發跡的鹿港辜家在1919年蓋的舊居。\n鹿港辜家祖籍大清福建泉州三邑惠安，曾祖父辜禮歡早期因反抗清廷而從惠安輾轉逃到暹羅及海峽殖民地檳城，為檳城富商及僑領。辜禮歡次子辜安平再由檳城遷居鹿港，至辜顯榮一代始發跡\n鹿港辜家是臺灣的知名望族，同時也是臺灣清治時期末、歷經日治時期一直到戰後時期，地方上曾顯赫一時的臺灣五大家族，發跡於彰化鹿港而得名。該家族的始祖為辜顯榮之祖父辜安平。其於臺灣日治時期因引日軍進台北城而崛起，家族至今在臺灣政商界仍有舉足輕重的地位；2001年分家，家族旗下主要企業分為辜岳甫家族的「中信辜家」\n而說到鹿港辜家，就不能不提該家族的始祖辜顯榮。S\n他在臺灣成為殖民地的1895年，因引日軍進臺北城而崛起，並因親近日本統治者而三番兩次獲得各種好處。\n回到中日甲午戰爭結束，清廷戰敗、臺灣割讓予日本，短暫成立的臺灣民主國亦在大總統唐景崧潛離之後瓦解，當時臺北城內亂兵四出騷擾劫掠，艋舺仕紳連袂趕赴大稻埕茶葉鉅商李春生宅邸商議。李春生眼見社會亂象，痛心疾首，認為臺灣民主國一無可取，且敗兵劫掠，擾亂社會秩序，臺灣應依《馬關條約》由大日本帝國統治，故促請該日軍早日進城鎮撫。惟請師的呈文雖已擬好，仕紳們既害怕城外的民兵會威脅到他們的生命財產，又怕率先去迎接日軍進城，萬一臺灣民主國捲土重來，恐怕會遭整肅，因此無人人敢冒險呈遞文書。此時，艋舺雜貨店「瑞昌成號」店主辜顯榮自告奮勇，向眾人表示願意前往基隆呈遞文書，促請日軍進入臺北城維持秩序。在辜顯榮的導引之下，日軍於5月15日（陽曆6月7日）凌晨輕易地長驅直入臺北城。\n辜顯榮在日治時代第一次獲日本官方委以重任的角色是臺北保良局局長，後來他更創立「保甲總局」，在保甲內實施「連坐法」，阻止臺灣本地抗日武裝之勢力，並組織壯丁團，討伐抗日軍。1923年，以霧峰林家的林獻堂為首所領導之「臺灣議會設置請願運動」正蓬勃發展之際，以辜顯榮為首另組成所謂「公益會」，成為與「議會請願運動」對抗的團體。1924年辜更召開「有力者大會」，在東京各大報紙刊登廣告，指林獻堂等人領導的議會請願運動並非臺灣人真正的意願等，藉此對抗如火如荼的臺灣自治運動。\n \n日治時期，當時的臺灣總督府特別惠賜辜家於鹿港建造一座洋樓宅邸，即今天的鹿港民俗文物館。\n由於辜顯榮對臺灣總督府方面的各項措施極力配合，故順利取得許多特權事業，如鹽、糖、鴉片、樟腦等經營權，並積極從事土地開墾、金融事業等各項投資，使得辜顯榮的事業版圖在日治時期達到巔峰，並為鹿港辜家累積了龐大的財富、人脈及社經地位。\n鹿港民俗文物館開放參觀的兩棟建築：洋樓與古風樓，其中，洋樓更是由臺灣總督府官員協助興建的豪華宅邸。建築物在1970年代轉成為博物館。\n本館共分兩棟建築，包括一棟具有二百年歷史的傳統閩南式建築「古風樓」，以及一棟近百年的文藝復興時代後期巴洛克式建築「洋樓」。館內收藏品共計六千S餘件，以前清中葉至民國初年的民俗器物為主，舉凡食、衣、住、行、育樂、宗教禮俗，及節日慶典等民俗文物皆有展示，不僅充分展。",
        address: "505彰化縣鹿港鎮館前街88號",
        imageUrl: "https://picsum.photos/400/250?random=1" 
    },
    {
        name: "鹿港老街",
        lat: 24.056299067209714,
        lng: 120.4325809518184,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮埔頭街3號",
        imageUrl: "https://picsum.photos/400/250?random=2"
    },
    {
        name: "鹿港新祖宮",
        lat: 24.058152614706362,
        lng: 120.43125932608194,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮埔頭街96號",
        imageUrl: "https://picsum.photos/400/250?random=3"
    },
    {
        name: "鹿港龍山寺",
        lat: 24.050349775172926, 
        lng: 120.43496139927807,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮金門巷81號",
        imageUrl: "https://picsum.photos/400/250?random=4"
    },
    {
        name: "鹿港公會堂",
        lat: 24.057529614451553,
        lng: 120.43185588117622,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮埔頭街72號",
        imageUrl: "https://picsum.photos/400/250?random=5"
    },
    {
        name: "意和行",
        lat: 24.05603865384436,
        lng: 120.43269952609515,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮瑤林街17號",
        imageUrl: "https://picsum.photos/400/250?random=6"
    },
    {
        name: "鹿港丁家古厝",
        lat: 24.053454561556013,
        lng: 120.43605986510771,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮中山路132號",
        imageUrl: "https://picsum.photos/400/250?random=7"
    },
    {
        name: "鹿港鎮史館",
        lat: 24.057260786049238,
        lng: 120.43541390904046,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮民權路160巷2號",
        imageUrl: "https://picsum.photos/400/250?random=8"
    },
    {
        name: "文武廟",
        lat: 24.048819199884026,
        lng: 120.43846306553822,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮青雲路2號",
        imageUrl: "https://picsum.photos/400/250?random=9"
    },
    {
        name: "鹿港鶴棲別墅",
        lat: 24.054867635003045,
        lng: 120.43408709629642,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮後車巷8號",
        imageUrl: "https://picsum.photos/400/250?random=10"
    },
    {
        name: "鹿港南靖宮",
        lat: 24.057672708148196,
        lng: 120.43161042328073,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮埔頭街78號",
        imageUrl: "https://picsum.photos/400/250?random=11"
    },
    {
        name: "鹿港日茂行",
        lat: 24.058535526241016,
        lng: 120.42926583347197,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮泉州街70號",
        imageUrl: "https://picsum.photos/400/250?random=12"
    },
    {
        name: "鹿港天后宮",
        lat: 24.059271772798237,
        lng: 120.43146597733531,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮中山路430號",
        imageUrl: "https://picsum.photos/400/250?random=13"
    },
    {
        name: "鹿港桂花巷藝術村",
        lat: 24.05585218497819,
        lng: 120.43192762684824,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮桂花巷505號",
        imageUrl: "https://picsum.photos/400/250?random=30"
    },
    {
        name: "半邊井",
        lat: 24.056020267552043,
        lng: 120.43299075782491,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮瑤林街12號",
        imageUrl: "https://picsum.photos/400/250?random=31"
    },
    {
        name: "友鹿軒",
        lat: 24.056115961711864,
        lng: 120.43291349972209,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮瑤林街18號",
        imageUrl: "https://picsum.photos/400/250?random=32"
    },
    {
        name: "摸乳巷",
        lat: 24.051749716695998,
        lng: 120.43220569342378,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮菜園里菜園路38號與40號間的長巷",
        imageUrl: "https://picsum.photos/400/250?random=33"
    },
    {
        name: "君子巷",
        lat: 24.056693829594046,
        lng: 120.43227917384458,
        category: "古蹟",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮埔頭街31號號旁",
        imageUrl: "https://picsum.photos/400/250?random=34"
    },
    //  ---------- 店家 ----------
    {
        name: "鄭玉珍餅舖",
        lat: 24.0565880365232,
        lng: 120.43231625874921,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮埔頭街23號",
        imageUrl: "https://picsum.photos/400/250?random=14"
    },
    {
        name: "素珠芋丸",
        lat: 24.058652488064542,
        lng: 120.42997053648524,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮民生路68號",
        imageUrl: "https://picsum.photos/400/250?random=15"
    },
    {
        name: "施家米糕",
        lat: 24.057885257228317,
        lng: 120.43682468107978,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮復興路365號",
        imageUrl: "https://picsum.photos/400/250?random=16"
    },
    {
        name: "萬能錫藝館",
        lat: 24.05196351796391,
        lng: 120.43420264787044,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮德興街23號",
        imageUrl: "https://picsum.photos/400/250?random=17"
    },
    {
        name: "玉珍齋",
        lat: 24.054619026921053,
        lng: 120.43457767551381,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "50546彰化縣鹿港鎮民族路168號",
        imageUrl: "https://picsum.photos/400/250?random=18"
    },
        {
        name: "港城豆花",
        lat: 24.05581145710149,
        lng: 120.43336287407666,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮民權路244號",
        imageUrl: "" 
    },
    {
        name: "鹿港吳敦厚燈鋪",
        lat: 24.0572511731095,
        lng: 120.43336445439033,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "50563彰化縣鹿港鎮中山路310號",
        imageUrl: "https://picsum.photos/400/250?random=20"
    },
    {
        name: "聯興神桌佛像百年老店",
        lat: 24.05313103852174,
        lng: 120.43559068957502,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮中山路125號",
        imageUrl: "https://picsum.photos/400/250?random=21"
    },
    {
        name: "長源醫院—鹿港歷史影像館",
        lat: 24.05464563023779,
        lng: 120.43505905043648,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮中山路194號",
        imageUrl: "https://picsum.photos/400/250?random=22"
    },
    {
        name: "鹿港施美玉名香祖舖",
        lat: 24.055044144877993,
        lng: 120.43432618562835,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮中山路219號",
        imageUrl: "https://picsum.photos/400/250?random=23"
    },
    {
        name: "景賢黃木屐專賣",
        lat: 24.05851234147763,
        lng: 120.43136242874124,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮文開路4號",
        imageUrl: "https://picsum.photos/400/250?random=24"
    },
    {
        name: "黃百和香舖",
        lat: 24.05846797545706,
        lng: 120.43153238946479,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮中山路387號",
        imageUrl: "https://picsum.photos/400/250?random=25"
    },
    {
        name: "店小二肉包",
        lat: 24.05859375798035,
        lng: 120.43181210373487,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮中山路386號",
        imageUrl: "https://picsum.photos/400/250?random=26"
    },
    {
        name: "凰珍囍餅",
        lat: 24.059215123643785,
        lng: 120.43034362050166,
        category: "店家",
        story: "地點的故事和介紹。",
        address: "505彰化縣鹿港鎮民生路42號",
        imageUrl: "https://picsum.photos/400/250?random=29"
    },
    /*
    {
        name: "新地點名稱",
        lat: 緯度,
        lng: 經度,
        category: "分類",
        story: "地點的故事和介紹。",
        address: "完整地址",
        imageUrl: "https://example.com/new_place.jpg" 
    },
    */

];


